nxp-appcodehub/dm-mcxn-portable-anomaly-detect-demo/dm-mcxn-portable-anomaly-detect/drivers/fsl_pwm.c
        if (doSync)
        {
            /* Set LDOK bit to load VALx bit */
            base->MCTRL |= PWM_MCTRL_LDOK(1UL << (uint8_t)subModule);
        }
    }
    else
    {
        return kStatus_Fail;
    }

    return kStatus_Success;
}

/*!
 * brief Updates the PWM signal's dutycycle.
 *
 * The function updates the PWM dutycyle to the new value that is passed in.
 * If the dead time insertion logic is enabled then the pulse period is reduced by the
 * dead time period specified by the user.
 *
 * param base              PWM peripheral base address
 * param subModule         PWM submodule to configure
 * param pwmSignal         Signal (PWM A or PWM B) to update
 * param currPwmMode       The current PWM mode set during PWM setup
 * param dutyCyclePercent  New PWM pulse width, value should be between 0 to 100
 *                          0=inactive signal(0% duty cycle)...
 *                          100=active signal (100% duty cycle)
 */
void PWM_UpdatePwmDutycycle(PWM_Type *base,
                            pwm_submodule_t subModule,
                            pwm_channels_t pwmSignal,
                            pwm_mode_t currPwmMode,
                            float dutyCyclePercent)
{
    assert(dutyCyclePercent <= 100U);
    /*assert(pwmSignal != kPWM_PwmX);*/   /* Work Around - Jira Ticket:
                                             https://jira.sw.nxp.com/browse/MCUX-69597*/

    uint16_t reloadValue = dutyCycleToReloadValue(dutyCyclePercent);

    PWM_UpdatePwmDutycycleHighAccuracy(base, subModule, pwmSignal, currPwmMode, reloadValue);
}

/*!
 * brief Updates the PWM signal's dutycycle with 16-bit accuracy.
 *
 * The function updates the PWM dutycyle to the new value that is passed in.
 * If the dead time insertion logic is enabled then the pulse period is reduced by the
 * dead time period specified by the user.
 *
 * param base              PWM peripheral base address
 * param subModule         PWM submodule to configure
 * param pwmSignal         Signal (PWM A or PWM B) to update
 * param currPwmMode       The current PWM mode set during PWM setup
 * param dutyCycle         New PWM pulse width, value should be between 0 to 65535
 *                          0=inactive signal(0% duty cycle)...
 *                          65535=active signal (100% duty cycle)
 */
void PWM_UpdatePwmDutycycleHighAccuracy(
    PWM_Type *base, pwm_submodule_t subModule, pwm_channels_t pwmSignal, pwm_mode_t currPwmMode, uint16_t dutyCycle)
{
    /*assert(pwmSignal != kPWM_PwmX);*/ /* Work Around - Jira Ticket:
	                                       https://jira.sw.nxp.com/browse/MCUX-69597*/
    uint16_t pulseCnt = 0, pwmHighPulse = 0;
    uint16_t modulo = 0;

    switch (currPwmMode)
    {
        case kPWM_SignedCenterAligned:
            modulo   = base->SM[subModule].VAL1 + 1U;
            pulseCnt = modulo * 2U;
            /* Calculate pulse width */
            pwmHighPulse = (pulseCnt * dutyCycle) / 65535U;
            break;
        case kPWM_CenterAligned:
            pulseCnt = base->SM[subModule].VAL1 + 1U;
            /* Calculate pulse width */
            pwmHighPulse = (pulseCnt * dutyCycle) / 65535U;
            break;
        case kPWM_SignedEdgeAligned:
            modulo   = base->SM[subModule].VAL1 + 1U;
            pulseCnt = modulo * 2U;
            /* Calculate pulse width */
            pwmHighPulse = (pulseCnt * dutyCycle) / 65535U;
            break;
        case kPWM_EdgeAligned:
            pulseCnt = base->SM[subModule].VAL1 + 1U;
            /* Calculate pulse width */
            pwmHighPulse = (pulseCnt * dutyCycle) / 65535U;
            break;
        default:
            assert(false);
            break;
    }

    /* Update register about dutycycle */
    if (kPWM_PwmA == pwmSignal)
    {
        PWM_SetDutycycleRegister(base, subModule, kPWM_PwmA, currPwmMode, pulseCnt, pwmHighPulse);
    }
    else if (kPWM_PwmB == pwmSignal)
    {
        PWM_SetDutycycleRegister(base, subModule, kPWM_PwmB, currPwmMode, pulseCnt, pwmHighPulse);
    }
    else if (kPWM_PwmX == pwmSignal) /* Work Around - Jira Ticket:
                                        https://jira.sw.nxp.com/browse/MCUX-69597*/
   {
	PWM_SetDutycycleRegister(base, subModule, kPWM_PwmX, currPwmMode, pulseCnt, pwmHighPulse);
   }

    if (kPWM_PwmX != pwmSignal)
    {
        /* Get the pwm duty cycle */
        s_pwmGetPwmDutyCycle[subModule][pwmSignal] = (uint8_t)(dutyCycle * 100U / 65535U);
    }
}

/*!
 * brief Update the PWM signal's period and dutycycle for a PWM submodule.
 *
 * The function updates PWM signal period generated by a specific submodule according to the parameters
 * passed in by the user. This function can also set dutycycle weather you want to keep original dutycycle
 * or update new dutycycle. Call this function in local sync control mode because PWM period is depended by  
 * INIT and VAL1 register of each submodule. In master sync initialization control mode, call this function 
 * to update INIT and VAL1 register of all submodule because PWM period is depended by INIT and VAL1 register
 * in submodule0. If the dead time insertion logic is enabled, the pulse period is reduced by the dead time 
 * period specified by the user. PWM signal will not be generated if its period is less than dead time duration.
 *
 * param base        PWM peripheral base address
 * param subModule   PWM submodule to configure
 * param pwmSignal   Signal (PWM A or PWM B) to update
 * param currPwmMode The current PWM mode set during PWM setup, options available in enumeration ::pwm_mode_t
 * param pulseCnt    New PWM period, value should be between 0 to 65535
 *                    0=minimum PWM period...
 *                    65535=maximum PWM period
 * param dutyCycle   New PWM pulse width of channel, value should be between 0 to 65535
 *                    0=inactive signal(0% duty cycle)...
 *                    65535=active signal (100% duty cycle)
 *                    You can keep original dutycycle or update new dutycycle
 */
void PWM_UpdatePwmPeriodAndDutycycle(PWM_Type *base,
                                     pwm_submodule_t subModule,
                                     pwm_channels_t pwmSignal,
                                     pwm_mode_t currPwmMode,
                                     uint16_t pulseCnt,
                                     uint16_t dutyCycle)
{
    uint16_t pwmHighPulse = 0;

